<? PHP
$ news  = [ " sport " => [ " К. Роналду забил три гола в последних пяти матчах " , " Головкин выиграл матч за титул " ], " policy " => [ " Трамп отменил свой визит в Северную Корею, из-за санкции " , " Н. Назарбаев утвердил новую версию алфавита " ]];
$ category  =  " sport " ];
< HREF = " ? Task92.php категория = спорт " > Новости спорта </ > | < HREF = " task92.php? Категория = политика " > Politic новости </ > < бр /> < бр />  
< HREF = " task92.php категория = спорт и формат = JSON? " > Новости спорта (JSON) </ > | < HREF = " task92.php? Категория = политика и формат = JSON " > Politic новости (JSON) </ > < бр /> < бр />  
?>